# YOLOv5 Custom: The Final, Architecturally and Spatially Correct Version

nc: 1
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  # 1. --- A Single, Unambiguous Starting Point ---
  - [-1, 1, nn.Identity, []]             # Layer 0: 虚拟层, 仅用于创建唯一的起点 (输出4通道)

  # 2. --- Input Separation ---
  - [0, 1, Slice, [[0, 3]]]             # Layer 1: 从 L0 输出中切片RGB (3通道)
  - [0, 1, Slice, [[3, 4]]]             # Layer 2: 从 L0 输出中切片Thermal (1通道)

  # 3. --- Parallel Backbones ---
  # 3a. --- RGB Backbone ---
  - [1, 1, Conv, [64, 6, 2, 2]]      # 3 (s=2)
  - [-1, 1, Conv, [128, 3, 2, 1]]   # 4 (s=4)
  - [-1, 3, C3, [128]]              # 5
  - [-1, 1, Conv, [256, 3, 2, 1]]   # 6 (s=8)
  - [-1, 6, C3, [256]]              # 7: P3/8 RGB Output (128 channels)
  - [-1, 1, Conv, [512, 3, 2, 1]]   # 8 (s=16)
  - [-1, 9, C3, [512]]              # 9: P4/16 RGB Output (256 channels)
  - [-1, 1, Conv, [1024, 3, 2, 1]]  # 10 (s=32)
  - [-1, 3, SPPF, [1024, 5]]        # 11: P5/32 RGB Output (512 channels)

  # 3b. --- Thermal Backbone ---
  - [2, 1, Conv, [64, 6, 2, 2]]      # 12 (s=2)
  - [-1, 1, Conv, [128, 3, 2, 1]]   # 13 (s=4)
  - [-1, 3, C3, [128]]              # 14
  - [-1, 1, Conv, [256, 3, 2, 1]]   # 15 (s=8)
  - [-1, 6, C3, [256]]              # 16: P3/8 Thermal Output (128 channels)
  - [-1, 1, Conv, [512, 3, 2, 1]]   # 17 (s=16)
  - [-1, 9, C3, [512]]              # 18: P4/16 Thermal Output (256 channels)
  - [-1, 1, Conv, [1024, 3, 2, 1]]  # 19 (s=32)
  - [-1, 3, SPPF, [1024, 5]]        # 20: P5/32 Thermal Output (512 channels)
  
  # 3c. --- Edge Pyramid (Spatially Corrected!) ---
  - [[1, 2], 1, EdgeGenerator, [2]]   # 21 (s=1)
  - [21, 1, Conv, [64, 6, 2, 2]]    # 22 (s=2)
  - [-1, 1, Conv, [128, 3, 2, 1]]   # 23 (s=4)
  - [-1, 1, Conv, [256, 3, 2, 1]]   # 24: P3/8 Edge Output -> 128 channels, s=8
  - [-1, 1, Conv, [512, 3, 2, 1]]   # 25: P4/16 Edge Output -> 256 channels, s=16
  - [-1, 1, Conv, [1024, 3, 2, 1]]  # 26: P5/32 Edge Output -> 512 channels, s=32

  # 4. --- Multi-Scale Guided Fusion ---
  - [[7, 16, 24], 1, CosineGuidedFusion, [512]]   # 27
  - [[9, 18, 25], 1, CosineGuidedFusion, [1024]]  # 28
  - [[11, 20, 26], 1, CosineGuidedFusion, [2048]] # 29

# 5. --- Detection Head (FPN+PAN) ---
head:
  - [-1, 1, Conv, [512, 1, 1]]            # 30 (from L29)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 31
  - [[-1, 28], 1, Concat, [1]]            # 32 (from L31, L28)
  - [-1, 3, C3, [512, False]]             # 33

  - [-1, 1, Conv, [256, 1, 1]]            # 34
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 35
  - [[-1, 27], 1, Concat, [1]]            # 36 (from L35, L27)
  - [-1, 3, C3, [256, False]]             # 37: P3 detect out

  - [-1, 1, Conv, [256, 3, 2]]            # 38 (from L37)
  - [[-1, 33], 1, Concat, [1]]            # 39 (from L38, L33)
  - [-1, 3, C3, [512, False]]             # 40: P4 detect out

  - [-1, 1, Conv, [512, 3, 2]]            # 41 (from L40)
  - [[-1, 30], 1, Concat, [1]]            # 42 (from L41, L30)
  - [-1, 3, C3, [1024, False]]            # 43: P5 detect out

  - [[37, 40, 43], 1, Detect, [nc, anchors]] #  Detect layer